app/controllers/dimensions_controller.rb

SELECT `dimensions`.* FROM `dimensions`
---
  def index
    @dimensions = Dimension.all

INSERT INTO `dimensions` (`length`, `created_at`, `updated_at`) VALUES (1000, '2016-06-28 06:27:47', '2016-06-28 06:27:47')
---
  def create
    @dimension = Dimension.new(dimension_params)

    respond_to do |format|
      if @dimension.save

SELECT  `dimensions`.* FROM `dimensions` WHERE `dimensions`.`id` = 1 LIMIT 1
---
    def set_dimension
      @dimension = Dimension.find(params[:id])